<?php
$to = "digital42@list.ru"; // емайл получателя данных из формы
$tema = "Заявка Digital"; // тема полученного емайла
$message = "Ваше имя: ".$_POST['name']."<br>";//присвоить переменной значение, полученное из формы name=name
$message .= "E-mail: ".$_POST['email']."<br>"; //полученное из формы name=email
$message .= "Сообщение: ".$_POST['message']."<br>"; //полученное из формы name=message
$headers  = 'MIME-Version: 1.0' . "\r\n"; // заголовок соответствует формату плюс символ перевода строки
$headers .= 'Content-type: text/html; charset=utf-8' . "\r\n"; // указывает на тип посылаемого контента
if (mail($to, $tema, $message, $headers)) {
	echo "Ваше сообщение успешно отправлено, в ближайшее время мы свяжемся с вами";
} else { "При отправке сообщения возникли ошибки, повторите попытку"; //отправляет получателю на емайл значения переменных
}?>